tap "thoughtbot/formulae"
tap "homebrew/services"
tap "heroku/brew"
tap "yqrashawn/goku"
brew "git"
brew "openssl"
brew "watchman"
brew "heroku/brew/heroku"
brew "parity"
brew "gh"
brew "imagemagick"
brew "bat"
brew "goku" # karabiner dsl
brew "minio"
brew "htop" # process viewer / manager

# Programming language prerequisites and package managers
brew "libyaml" # should come after openssl
brew "coreutils"
brew "curl"
brew "yarn"
brew "gpg" # required by asdf-nodejs
brew "the_silver_searcher" # the ag cli tool for fast file searching

# Mapping tools
brew "postgis"
brew "gdal"

# Databases
brew "postgres", restart_service: :changed
brew "redis", restart_service: :changed

# Applications
cask "karabiner-elements"
cask "iterm2"
cask "firefox"
cask "google-chrome"
cask "sourcetree"
cask "visual-studio-code"
cask "dropbox"
cask "shiftit"
cask "figma"
cask "imageoptim"
cask "pgadmin4"
cask "caffeine"